import packageJson from "../package.json" with { type: "json" };

const APP_BANNER = String.raw`

███████ ██████   ██████   ██████  ██      ███    ███  █████  ███    ██ 
██      ██   ██ ██    ██ ██    ██ ██      ████  ████ ██   ██ ████   ██ 
███████ ██████  ██    ██ ██    ██ ██      ██ ████ ██ ███████ ██ ██  ██ 
     ██ ██      ██    ██ ██    ██ ██      ██  ██  ██ ██   ██ ██  ██ ██ 
███████ ██       ██████   ██████  ███████ ██      ██ ██   ██ ██   ████                                                       
▄▄▄▄▄▄ ▄▄▄▄   ▄▄▄   ▄▄▄▄ ▄▄ ▄▄ ▄▄▄▄▄ ▄▄▄▄  
  ██   ██▄█▄ ██▀██ ██▀▀▀ ██▄█▀ ██▄▄  ██▄█▄ 
  ██   ██ ██ ██▀██ ▀████ ██ ██ ██▄▄▄ ██ ██                                                           
`;

export function printStartupBanner() {

  process.stdout.write(`${APP_BANNER}\nVersion ${packageJson.version}\n\n`);
}
